#+TITLE: IPython Integration Test
#+AUTHOR: Jason Walsh
#+OPTIONS: ^:nil toc:2 num:t
#+PROPERTY: header-args:python :session *Python* :results output :exports both

** Environment Check
:PROPERTIES:
:CUSTOM_ID: environment-check
:END:

First, let's check our Python environment and ensure IPython is available:

#+BEGIN_SRC python
import sys
print(f"Python version: {sys.version}")

# Check if IPython is available
try:
    import IPython
    print(f"IPython version: {IPython.__version__}")
    print(f"IPython is correctly loaded: {'IPython' in sys.modules}")
    
    # Get the current IPython instance
    ipython = IPython.get_ipython()
    if ipython:
        print(f"Active IPython type: {type(ipython).__name__}")
    else:
        print("No active IPython instance found.")
except ImportError:
    print("IPython is not installed in this environment.")
#+END_SRC

#+RESULTS:
: Python version: 3.11.2 (main, Nov 30 2024, 21:22:50) [GCC 12.2.0]
: IPython is not installed in this environment.

** Session Persistence Test
:PROPERTIES:
:CUSTOM_ID: session-persistence
:END:

Let's define a variable and verify it persists between code blocks:

#+BEGIN_SRC python
test_variable = "This variable should persist between code blocks"
print(f"Defined: {test_variable}")
#+END_SRC

#+RESULTS:
: Defined: This variable should persist between code blocks

Now let's check if the variable is still accessible:

#+BEGIN_SRC python
try:
    print(f"Retrieved: {test_variable}")
except NameError:
    print("ERROR: The variable was not persisted between code blocks!")
#+END_SRC

#+RESULTS:
: Retrieved: This variable should persist between code blocks

** Code Completion and Help
:PROPERTIES:
:CUSTOM_ID: code-completion
:END:

Test help and documentation features:

#+BEGIN_SRC python
# This block doesn't require you to press tab, but verifies
# that IPython's rich help is working
help(str.split)

# Print docstring
print("\nDocstring for max function:")
print(max.__doc__)
#+END_SRC

#+RESULTS:
#+begin_example
Help on method_descriptor:

split(self, /, sep=None, maxsplit=-1)
    Return a list of the substrings in the string, using sep as the separator string.
    
      sep
        The separator used to split the string.
    
        When set to None (the default value), will split on any whitespace
        character (including \\n \\r \\t \\f and spaces) and will discard
        empty strings from the result.
      maxsplit
        Maximum number of splits (starting from the left).
        -1 (the default value) means no limit.
    
    Note, str.split() is mainly useful for data that has been intentionally
    delimited.  With natural text that includes punctuation, consider using
    the regular expression module.


Docstring for max function:
max(iterable, *[, default=obj, key=func]) -> value
max(arg1, arg2, *args, *[, key=func]) -> value

With a single iterable argument, return its biggest item. The
default keyword-only argument specifies an object to return if
the provided iterable is empty.
With two or more arguments, return the largest argument.
#+end_example

** Debugging Integration
:PROPERTIES:
:CUSTOM_ID: debugging
:END:

Test debugger integration:

#+BEGIN_SRC python
def function_to_debug(n):
    """A function with steps we can debug"""
    result = 0
    for i in range(n):
        result += i * i
    
    # Uncomment to debug interactively
    # import pdb; pdb.set_trace()
    
    return result

# Run the function without debugging
result = function_to_debug(5)
print(f"Result: {result}")

# How to use the debugger
print("\nTo debug: uncomment the pdb line and re-run")
print("Common pdb commands:")
print("  n - next line")
print("  s - step into function")
print("  c - continue execution")
print("  p <expr> - print expression")
print("  q - quit debugging")
#+END_SRC

#+RESULTS:
: Result: 30
: 
: To debug: uncomment the pdb line and re-run
: Common pdb commands:
:   n - next line
:   s - step into function
:   c - continue execution
:   p <expr> - print expression
:   q - quit debugging

** Error Handling and Traceback
:PROPERTIES:
:CUSTOM_ID: error-handling
:END:

Test error traceback formatting:

#+BEGIN_SRC python
try:
    # This will cause an error
    1/0
except Exception as e:
    print(f"Caught exception: {type(e).__name__}: {e}")
    
    # Print traceback
    import traceback
    print("\nTraceback:")
    traceback.print_exc()
#+END_SRC

#+RESULTS:
: Caught exception: ZeroDivisionError: division by zero
: 
: Traceback:
: Traceback (most recent call last):
:   File "/tmp/python-m5zDDi", line 3, in <module>
:     1/0
:     ~^~
: ZeroDivisionError: division by zero

** Memory Usage
:PROPERTIES:
:CUSTOM_ID: memory
:END:

Check memory usage:

#+BEGIN_SRC python
# Try using memory_profiler if available
try:
    import memory_profiler
    print("Memory profiler available")
    
    # Define a function to profile
    @memory_profiler.profile
    def memory_test():
        """Test memory usage"""
        # Create a large list
        large_list = [i for i in range(1000000)]
        return sum(large_list)
    
    # Run the function
    result = memory_test()
    print(f"Result: {result}")
    
except ImportError:
    print("Memory profiler not available, install with: pip install memory_profiler")
    
    # Alternative memory usage check
    import resource
    usage = resource.getrusage(resource.RUSAGE_SELF)
    print(f"Memory usage: {usage.ru_maxrss / 1024:.2f} MB")
#+END_SRC

#+RESULTS:
: Memory profiler not available, install with: pip install memory_profiler
: Memory usage: 13.81 MB

